# Run on macOS with:
#   brew bundle --file Brewfile

###############################################################################
# Taps
###############################################################################

tap "anomalyco/tap"
tap "slp/krun", "https://github.com/libkrun/homebrew-krun.git"

###############################################################################
# CLI Tools
###############################################################################

# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"

# Create and run Linux containers using lightweight virtual machines
brew "container"

# Distributed revision control system
brew "git"

# Postgres C API library
brew "libpq"

# AI coding agent for the terminal
brew "anomalyco/tap/opencode", trusted: true

# Theme for zsh
brew "powerlevel10k"

# Dotfile manager
brew "stow"

###############################################################################
# Development
###############################################################################

# VS Code without Microsoft branding/telemetry
cask "vscodium"

###############################################################################
# Browsers
###############################################################################

cask "chromium"
cask "librewolf"

###############################################################################
# Terminal
###############################################################################

cask "iterm2"

###############################################################################
# Media
###############################################################################

cask "iina"
cask "vlc"

###############################################################################
# Productivity
###############################################################################

cask "notion"

###############################################################################
# Security & System
###############################################################################

# Open-source firewall
cask "lulu"

# File system integration
cask "macfuse"

# Prevent Apple Music from launching automatically
cask "notunes"

# Secure messaging
cask "signal"

# Disk encryption
cask "veracrypt"

###############################################################################
# Fonts
###############################################################################

cask "font-jetbrains-mono-nerd-font"

###############################################################################
# VS Code Extensions
###############################################################################

vscode "mechatroner.rainbow-csv"
vscode "wdhongtw.gpg-indicator"
vscode "yzane.markdown-pdf"